using System;
using System.Collections.Generic;
using System.Data;
using System.Windows;
using System.Windows.Media;

namespace CalcMatriz;

public class 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧
{
	public int _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE;

	public int 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕;

	public double[,] 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬;

	public double 蛲蛯蛦蜇蜛蛙蜂蛔蛥蛒蛔蛖蛕蛙蛗;

	public static List<double> 蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒 = new List<double>();

	public static double ᴲᴮᴲᴰᴃᴾᴛᴮᴰᴼᴳᴷ_1CFEᴆᴱ(string 뵾뵬붙붦뵱뵱뵫뵫뵹붣붤붋붛붂뵰)
	{
		DataTable dataTable = new DataTable();
		dataTable.Columns.Add("expression", typeof(string), 뵾뵬붙붦뵱뵱뵫뵫뵹붣붤붋붛붂뵰);
		DataRow dataRow = dataTable.NewRow();
		dataTable.Rows.Add(dataRow);
		return double.Parse((string)dataRow["expression"]);
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 穚穋稫穗稫稪種稥穃穖穙稫稥稨穋(string ꄨꄱꄢꅟꅖꄩꅕꄡꅚꅖꄣꅧꅦꄥꅜ)
	{
		if (!string.IsNullOrEmpty(ꄨꄱꄢꅟꅖꄩꅕꄡꅚꅖꄣꅧꅦꄥꅜ))
		{
			string[] array = ꄨꄱꄢꅟꅖꄩꅕꄡꅚꅖꄣꅧꅦꄥꅜ.Split(new char[2] { '\n', '\r' }, StringSplitOptions.RemoveEmptyEntries);
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(array.Length, array[0].Split(new char[1] { ' ' }).Length);
			string[] array2 = array[0].Split(new char[1] { ' ' });
			for (int i = 0; i < array.Length; i++)
			{
				for (int j = 0; j < array2.Length; j++)
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, double.Parse((!string.IsNullOrWhiteSpace(array[i].Split(new char[1] { ' ' })[j])) ? array[i].Split(new char[1] { ' ' })[j] : "0"));
				}
			}
			return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
		}
		return new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(0, 0);
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 䠕䠹䠺䡇䡑䡄䠒䡆䡇䡈䡄䡇䠔䡄䠚(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _0957ॿঌঊঔख़ঌ_0970य़ঊड़ॠঈय़ड़, double 琡琍珱珵琝琥珬琈琟琲珮琠珬班珯, double _FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(2, 2);
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, 0, 琡琍珱珵琝琥珬琈琟琲珮琠珬班珯);
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, 1, 0.0);
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, 0, 0.0);
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, 1, _FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD_FFFD);
		return 贏賤賢賷賹贜賛賡賳賤賿贏賤賞贐(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2, _0957ॿঌঊঔख़ঌ_0970य़ঊड़ॠঈय़ड़);
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 큆큇큇큌큊큛큪클킇큠큋큹큷큻큆(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 珱珤珤珦珟珮琑珝琐琎珡琡琓珱珤, double 鈷鈹鈳鉣鈵鉣鈶鈹鈳鈴鈱鉢鈷鉢鈲, double _F0C8_F0C9_F0D9_F0CB_F0CB_F0F8_F0C4_F0CB_F0C9_F0D7_F0CB_F0F5_F0CB_F0F7_F0CB)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(珱珤珤珦珟珮琑珝琐琎珡琡琓珱珤._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, 珱珤珤珦珟珮琑珝琐琎珡琡琓珱珤.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
		for (int i = 0; i < 珱珤珤珦珟珮琑珝琐琎珡琡琓珱珤.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; i++)
		{
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, i, 鈷鈹鈳鉣鈵鉣鈶鈹鈳鈴鈱鉢鈷鉢鈲);
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, i, 0.0 - _F0C8_F0C9_F0D9_F0CB_F0CB_F0F8_F0C4_F0CB_F0C9_F0D7_F0CB_F0F5_F0CB_F0F7_F0CB);
		}
		return 乽乻亥亱什乿乿亮乾亄亂京乾亠亯(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2, 珱珤珤珦珟珮琑珝琐琎珡琡琓珱珤);
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 뤒뤘뤓뤘뤘뤔뤘뤚륅뤓륐뤖뤕륅뤒(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(_F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, _F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
		for (int i = 0; i < _F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < _F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, Math.Pow(-1.0, i + j) * 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(ꩨ_AA32ꩆꩧ_AA2C_AA2D_AA30ꩩ_AA5C_AA2Cꩫꩳꩮꩦ_AA2D(i, j, _F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508)));
			}
		}
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧3 = 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ȦȼɏȉȊȾɑȏɀȹȜȻɇɂȈ();
		return _2670_2660_2650_264E_2654_2685_268E_264E_2688_2654_266B_2653_2663_264D_2681(塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(_F541_F507_F509_F538_F531_F500_F531_F501_F51B_F521_F505_F500_F522_F506_F508), 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧3, "div");
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _2A4E_2A6A_2A56_2A51_2A95_2A4E_2A4F_2A50_2A5F_2A80_2A4F_2A82_2A75_2A8E_2A82(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 充臭祐郞祐僧著侮勤館全隷免鶴著, double _295B_2965_2938_2936_2933_2975_2967_2952_2934_2966_2950_2975_2962_293A_2935)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(2, 2);
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, 0, Math.Round(Math.Cos(_295B_2965_2938_2936_2933_2975_2967_2952_2934_2966_2950_2975_2962_293A_2935 * (Math.PI / 180.0)), 2));
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, 1, Math.Round(0.0 - Math.Sin(_295B_2965_2938_2936_2933_2975_2967_2952_2934_2966_2950_2975_2962_293A_2935 * (Math.PI / 180.0)), 2));
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, 0, Math.Round(Math.Sin(_295B_2965_2938_2936_2933_2975_2967_2952_2934_2966_2950_2975_2962_293A_2935 * (Math.PI / 180.0)), 2));
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, 1, Math.Round(Math.Cos(_295B_2965_2938_2936_2933_2975_2967_2952_2934_2966_2950_2975_2962_293A_2935 * (Math.PI / 180.0)), 2));
		return 贏賤賢賷賹贜賛賡賳賤賿贏賤賞贐(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2, 充臭祐郞祐僧著侮勤館全隷免鶴著);
	}

	public 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _2F58_2F89_2F75_2F56_2F79_2F71_2F68_2F58_2F66_2F95_2F51_2F85_2F87_2F9B_2F55(int 墒墒墎増壃墿壄壏壂墎墐墐壁墭壕, int 鲅鲸鲪鲹鳆鲭鲵鲸鲕鳇鲍鲞鲹鲍鲋)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(_32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
		for (int i = 0; i < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				if (i == 墒墒墎増壃墿壄壏壂墎墐墐壁墭壕)
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(墒墒墎増壃墿壄壏壂墎墐墐壁墭壕, j, 혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(鲅鲸鲪鲹鳆鲭鲵鲸鲕鳇鲍鲞鲹鲍鲋, j));
				}
				else if (i == 鲅鲸鲪鲹鳆鲭鲵鲸鲕鳇鲍鲞鲹鲍鲋)
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(鲅鲸鲪鲹鳆鲭鲵鲸鲕鳇鲍鲞鲹鲍鲋, j, 혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(墒墒墎増壃墿壄壏壂墎墐墐壁墭壕, j));
				}
				else
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, 혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j));
				}
			}
		}
		return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 頚頓頇韷韛韙韗韘韖韞韚頇韧韟韞(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 㘷㘸㘉㘉㙍㙆㘣㘎㘻㙁㘌㘞㘊㘷㘷, double 먹먺먻먋먈먽멀먊먺먈멎멁먹먈먻)
	{
		for (int i = 0; i < 㘷㘸㘉㘉㙍㙆㘣㘎㘻㙁㘌㘞㘊㘷㘷.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; i++)
		{
			㘷㘸㘉㘉㙍㙆㘣㘎㘻㙁㘌㘞㘊㘷㘷.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, i, 㘷㘸㘉㘉㙍㙆㘣㘎㘻㙁㘌㘞㘊㘷㘷.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, i) * 먹먺먻먋먈먽멀먊먺먈멎멁먹먈먻);
		}
		return 㘷㘸㘉㘉㙍㙆㘣㘎㘻㙁㘌㘞㘊㘷㘷;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 ꩨ_AA32ꩆꩧ_AA2C_AA2D_AA30ꩩ_AA5C_AA2Cꩫꩳꩮꩦ_AA2D(int 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆, int _F709_F706_F701_F709_F702_F708_F708_F703_F735_F703_F724_F702_F735_F734_F702, 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(_0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE - 1, _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 - 1);
		int num = 0;
		for (int i = 0; i < _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			num = 0;
			for (int j = 0; j < _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				if (j == _F709_F706_F701_F709_F702_F708_F708_F703_F735_F703_F724_F702_F735_F734_F702 || i == 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆)
				{
					num++;
				}
				else if (j > _F709_F706_F701_F709_F702_F708_F708_F703_F735_F703_F724_F702_F735_F734_F702)
				{
					if (i > 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆)
					{
						跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i - 1, j - 1, _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j));
					}
					if (i < 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆)
					{
						跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j - 1, _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j));
					}
				}
				else if (j < _F709_F706_F701_F709_F702_F708_F708_F703_F735_F703_F724_F702_F735_F734_F702)
				{
					if (i > 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆)
					{
						跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i - 1, j, _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j));
					}
					if (i < 忤怑怛忢忡怗怏忡忝忯忣怒忥忥怆)
					{
						跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _0F03໑_0EED໓_0EF4_0F04_0F03_0EF8໓໕໖_0EEF໖_0F04_0F10.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j));
					}
				}
			}
		}
		return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _2670_2660_2650_264E_2654_2685_268E_264E_2688_2654_266B_2653_2663_264D_2681(double 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹, 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073, string 楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚)
	{
		for (int i = 0; i < _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				switch (㼖㼴㼈㼉㼆㼃㼅㼴㼦㼀㼵㽂㼈㼡㼟.ﾃﾋﾆﾈﾗﾶￊﾡﾄﾆﾸﾆﾳﾷￌ(楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚))
				{
				case 3712891560u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "sum")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] + 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹);
					}
					break;
				case 3696113941u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "sub")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] - 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹);
					}
					break;
				case 3951357313u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "mul")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] * 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹);
					}
					break;
				case 3848448840u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "div")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] / 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹);
					}
					break;
				case 804546073u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "res")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] % 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹);
					}
					break;
				case 2112764879u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "sqrt")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, Math.Sqrt(_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]));
					}
					break;
				case 1479764693u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "pow")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, Math.Pow(_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j], 䁞䁊䂀䁇䁺䁣䁻䁹䁼䁽䁇䁎䁈䁐䁹));
					}
					break;
				case 1062293841u:
					if (楊楆椛楆楛椘椘楖椶楃楇椖楃椳椚 == "log")
					{
						_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, Math.Log10(_E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]));
					}
					break;
				}
			}
		}
		return _E066_E058_E054_E055_E058_E084_E05A_E08A_E052_E088_E055_E058_E090_E05A_E073;
	}

	public double 껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(int 莙莑荑荑荐荭荸荗莁荒荔荕荔荘荒, int 唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘, bool 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱)
	{
		double num = 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[莙莑荑荑荐荭荸荗莁荒荔荕荔荘荒, 唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘];
		莙莑荑荑荐荭荸荗莁荒荔荕荔荘荒++;
		唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 = (跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱 ? (唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 + 1) : (唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 - 1));
		for (int i = 0; i < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE - 1; i++)
		{
			num *= 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[莙莑荑荑荐荭荸荗莁荒荔荕荔荘荒, 唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘];
			莙莑荑荑荐荭荸荗莁荒荔荕荔荘荒++;
			唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 = (跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱 ? (唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 + 1) : (唗唀哽哻唪哥唬哪哨唕唚唀哩唞唘 - 1));
		}
		return num;
	}

	public double 혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(int ﴞ_FD4Cﴠﴜﴛ_FD4Dﴢﴹ_FD43_FD41ﵔﴜﴶﴠﴷ, int 碶碲磤磣磨磰碱碳磀磒碵磥碸碱碳)
	{
		return 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[ﴞ_FD4Cﴠﴜﴛ_FD4Dﴢﴹ_FD43_FD41ﵔﴜﴶﴠﴷ, 碶碲磤磣磨磰碱碳磀磒碵磥碸碱碳];
	}

	public 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _E79A_E759_E760_E78C_E75E_E78A_E761_E758_E759_E79B_E78C_E75D_E75F_E78F_E76C()
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(_32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 + 2);
		for (int i = 0; i < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]);
			}
		}
		for (int k = 0; k < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; k++)
		{
			for (int l = 0; l < 2; l++)
			{
				跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(k, l + 3, 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[k, l]);
			}
		}
		return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _20A3_20D7_20B6_20A2_20D3_20D5_20D7_20D4_20A5_20A2_20A4_20D5_20B3_20D2_20A6(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊)
	{
		for (int i = 1; i < 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 1; j < 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j) - 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[0, j] * 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, 0]);
			}
		}
		return ꩨ_AA32ꩆꩧ_AA2C_AA2D_AA30ꩩ_AA5C_AA2Cꩫꩳꩮꩦ_AA2D(0, 0, 㔚㕁㕍㕍㕍㔞㔩㔞㕊㕚㔙㕖㕋㔘㕊);
	}

	public static double 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖)
	{
		double num = 0.0;
		if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕)
		{
			if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 1)
			{
				return 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, 0);
			}
			if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 2)
			{
				return 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 0, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: true) - 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 1, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: false);
			}
			if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 3)
			{
				跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._E79A_E759_E760_E78C_E75E_E78A_E761_E758_E759_E79B_E78C_E75D_E75F_E78F_E76C();
				num = 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 0, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: true) + 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 1, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: true) + 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 2, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: true) - (跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 2, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: false) + 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 3, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: false) + 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.껚꺼꺼꺾껕껂껿껰꼀께꺼껮껃껁껀(0, 4, 跼跸跪跘跜踄跖跖跗跗跖跓跔踖跱: false));
				foreach (double item in 蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒)
				{
					num *= item;
				}
				return Math.Round(num);
			}
			if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, 0) == 0.0)
			{
				int num2 = 0;
				for (int i = 1; i < 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
				{
					num2++;
					if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, 0) == 0.0)
					{
						continue;
					}
					if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, 0) == 1.0)
					{
						蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒.Add(-1.0);
						return 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(_20A3_20D7_20B6_20A2_20D3_20D5_20D7_20D4_20A5_20A2_20A4_20D5_20B3_20D2_20A6(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._2F58_2F89_2F75_2F56_2F79_2F71_2F68_2F58_2F66_2F95_2F51_2F85_2F87_2F9B_2F55(0, i)));
					}
					if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, 0) != 1.0)
					{
						蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒.Add(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, 0));
						蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒.Add(-1.0);
						double num3 = 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, 0);
						for (int j = 0; j < 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
						{
							艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(i, j) / num3);
						}
						return 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(_20A3_20D7_20B6_20A2_20D3_20D5_20D7_20D4_20A5_20A2_20A4_20D5_20B3_20D2_20A6(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._2F58_2F89_2F75_2F56_2F79_2F71_2F68_2F58_2F66_2F95_2F51_2F85_2F87_2F9B_2F55(0, i)));
					}
				}
				if (num2 == 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE)
				{
					return 0.0;
				}
				return 0.0;
			}
			if (艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, 0) == 1.0)
			{
				return 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(_20A3_20D7_20B6_20A2_20D3_20D5_20D7_20D4_20A5_20A2_20A4_20D5_20B3_20D2_20A6(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖));
			}
			蒕蒘蒓蒘蒒蒘蒑蓄蓅蒕蒔蒗蒚蓇蒒.Add(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, 0));
			double num4 = 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, 0);
			for (int k = 0; k < 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; k++)
			{
				艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, k, 艑舱艇艢艢艤艓色舵艅舸舲舱艭艖.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, k) / num4);
			}
			return 塄塧塷塅塸塉塇塈塇塊塪塊塇塼塌(_20A3_20D7_20B6_20A2_20D3_20D5_20D7_20D4_20A5_20A2_20A4_20D5_20B3_20D2_20A6(艑舱艇艢艢艤艓色舵艅舸舲舱艭艖));
		}
		return double.NaN;
	}

	public string 笀竌竆竄笄竷竊立竊竸竴竹立竸竃()
	{
		string text = "";
		for (int i = 0; i < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				text += ((j == 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 - 1) ? 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j].ToString() : (铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] + " "));
			}
			text += "\n";
		}
		return text;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 乽乻亥亱什乿乿亮乾亄亂京乾亠亯(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6, 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 䫝䫮䫠䬌䫿䫞䬖䫝䫚䫠䫻䬖䫿䬍䬚)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(_0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
		if (_0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 䫝䫮䫠䬌䫿䫞䬖䫝䫚䫠䫻䬖䫿䬍䬚._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE && _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 == 䫝䫮䫠䬌䫿䫞䬖䫝䫚䫠䫻䬖䫿䬍䬚.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕)
		{
			for (int i = 0; i < _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
			{
				for (int j = 0; j < _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, _0F05_0ECA_0EFC_0ECC_0ECD_0ECD_0EFA_0ECDໆ_0EC7_0EF8_0EC8_0F0A_0EC8_0EF6.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] + 䫝䫮䫠䬌䫿䫞䬖䫝䫚䫠䫻䬖䫿䬍䬚.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]);
				}
			}
			return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
		}
		return new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(0, 0);
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 ᨱ_19FEᨁᩁᨱᨮᨦᨁᨹᨑᨃᨮᨁᨲᨲ(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량, 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 敽敓敁敄敻故敊整敃敆敁敶敚敧敲)
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(랴럩랺럩럨럩럨럳랺럩럓럺럊랷량._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
		if (랴럩랺럩럨럩럨럳랺럩럓럺럊랷량._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE == 敽敓敁敄敻故敊整敃敆敁敶敚敧敲._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE && 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 == 敽敓敁敄敻故敊整敃敆敁敶敚敧敲.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕)
		{
			for (int i = 0; i < 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
			{
				for (int j = 0; j < 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
				{
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, 랴럩랺럩럨럩럨럳랺럩럓럺럊랷량.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j] - 敽敓敁敄敻故敊整敃敆敁敶敚敧敲.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]);
				}
			}
			return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
		}
		return new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(0, 0);
	}

	public 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 ȦȼɏȉȊȾɑȏɀȹȜȻɇɂȈ()
	{
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕, _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE);
		for (int i = 0; i < _32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
		{
			for (int j = 0; j < 䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
			{
				跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(j, i, 铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, j]);
			}
		}
		return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 贏賤賢賷賹贜賛賡賳賤賿贏賤賞贐(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀, 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _0746ݠݶݟݝݡݣ_0731ܮ_0734_0730ݢݨܯܬ)
	{
		if (㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 == _0746ݠݶݟݝݡݣ_0731ܮ_0734_0730ݢݨܯܬ._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE)
		{
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE, _0746ݠݶݟݝݡݣ_0731ܮ_0734_0730ݢݨܯܬ.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕);
			double num = 0.0;
			for (int i = 0; i < 㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀._32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE; i++)
			{
				for (int j = 0; j < _0746ݠݶݟݝݡݣ_0731ܮ_0734_0730ݢݨܯܬ.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; j++)
				{
					for (int k = 0; k < 㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; k++)
					{
						num += 㸘㷷㸎㷏㷔㸈㷖㷒㷏㸓㸘㷬㸃㷲㸀.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[i, k] * _0746ݠݶݟݝݡݣ_0731ܮ_0734_0730ݢݨܯܬ.铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[k, j];
					}
					跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, num);
					num = 0.0;
				}
			}
			return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
		}
		return new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(0, 0);
	}

	public void ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(int _25B5_25BA_25B6_25BD_25DD_25ED_25CC_25EB_25EB_25BA_25B9_25BA_25F9_25B9_25E9, int _E614_E628_E624_E609_E5E8_E605_E5E3_E5EB_E5E5_E607_E5E6_E620_E5E2_E5E3_E616, double _E874_E8A6_E87B_E87B_E874_E8B6_E87B_E895_E873_E87C_E87C_E87A_E87B_E8A6_E8A8)
	{
		铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬[_25B5_25BA_25B6_25BD_25DD_25ED_25CC_25EB_25EB_25BA_25B9_25BA_25F9_25B9_25E9, _E614_E628_E624_E609_E5E8_E605_E5E3_E5EB_E5E5_E607_E5E6_E620_E5E2_E5E3_E616] = _E874_E8A6_E87B_E87B_E874_E8B6_E87B_E895_E873_E87C_E87C_E87A_E87B_E8A6_E8A8;
	}

	public 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(int rowN, int columN, string formula)
	{
		_32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE = rowN;
		䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 = columN;
		铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬 = new double[rowN, columN];
		for (int i = 0; i < rowN; i++)
		{
			for (int j = 0; j < columN; j++)
			{
				string text = formula.Replace("i", (i + 1).ToString());
				text = text.Replace("j", (j + 1).ToString());
				ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(i, j, ᴲᴮᴲᴰᴃᴾᴛᴮᴰᴼᴳᴷ_1CFEᴆᴱ(text));
			}
		}
	}

	public static 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 _FAEA𢡊_FAEB謁覆_FAF3_FAE6覆_FAF7請諭諸諸謁_FADD(PointCollection _23F6_242C_2438_23F5_2417_2416_2407_23F2_23F5_243B_2424_2409_23F7_2409_2430, double 䬅䫿䫺䫆䫋䫺䫎䫉䫢䬃䫏䫏䫍䫈䫛, double _E6BA_E688_E690_E6C1_E68D_E6C7_E6A7_E6C2_E68C_E6A7_E68F_E690_E6BA_E68E_E6D1)
	{
		//IL_0018: Unknown result type (might be due to invalid IL or missing references)
		//IL_001d: Unknown result type (might be due to invalid IL or missing references)
		//IL_0032: Unknown result type (might be due to invalid IL or missing references)
		//IL_0037: Unknown result type (might be due to invalid IL or missing references)
		跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2 = new 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(2, _23F6_242C_2438_23F5_2417_2416_2407_23F2_23F5_243B_2424_2409_23F7_2409_2430.get_Count());
		for (int i = 0; i < _23F6_242C_2438_23F5_2417_2416_2407_23F2_23F5_243B_2424_2409_23F7_2409_2430.get_Count(); i++)
		{
			int num = i;
			Point val = _23F6_242C_2438_23F5_2417_2416_2407_23F2_23F5_243B_2424_2409_23F7_2409_2430.get_Item(i);
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(0, num, ((Point)(ref val)).get_X() + 䬅䫿䫺䫆䫋䫺䫎䫉䫢䬃䫏䫏䫍䫈䫛);
			int num2 = i;
			val = _23F6_242C_2438_23F5_2417_2416_2407_23F2_23F5_243B_2424_2409_23F7_2409_2430.get_Item(i);
			跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2.ʞˌʺˉʖʞˇˀʼ_02D4ˋˉʧʚː(1, num2, ((Point)(ref val)).get_Y() + _E6BA_E688_E690_E6C1_E68D_E6C7_E6A7_E6C2_E68C_E6A7_E68F_E690_E6BA_E68E_E6D1);
		}
		return 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧2;
	}

	public static PointCollection _F6E3_F70A_F6E6_F719_F714_F6E0_F704_F714_F6E5_F715_F6E5_F701_F6E4_F6FD_F6E4(跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧 苓芙苄芙苚苅芗芘芙芥苆芙芔芐芓, double _2DCFⷎ_2E00_2DFCⷎⷒⷋ_2E00_2E00_2DFC_2DF4_2DF0_2DECⷎ_2DFE, double ឲមឩល_17CA_17C6ផផ_17CAវ_17DBផ_17C6ឯល)
	{
		//IL_0001: Unknown result type (might be due to invalid IL or missing references)
		//IL_0007: Expected O, but got Unknown
		//IL_000e: Unknown result type (might be due to invalid IL or missing references)
		//IL_0039: Unknown result type (might be due to invalid IL or missing references)
		PointCollection val = new PointCollection();
		for (int i = 0; i < 苓芙苄芙苚苅芗芘芙芥苆芙芔芐芓.䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕; i++)
		{
			Point val2 = default(Point);
			((Point)(ref val2)).set_X(苓芙苄芙苚苅芗芘芙芥苆芙芔芐芓.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(0, i) + _2DCFⷎ_2E00_2DFCⷎⷒⷋ_2E00_2E00_2DFC_2DF4_2DF0_2DECⷎ_2DFE);
			((Point)(ref val2)).set_Y(苓芙苄芙苚苅芗芘芙芥苆芙芔芐芓.혴홍홬홦혶홣혻홨홨홦혻홧홥혷홧(1, i) + ឲមឩល_17CA_17C6ផផ_17CAវ_17DBផ_17C6ឯល);
			val.Add(val2);
		}
		return val;
	}

	public 跒趖跅趔趬趙跅跆趑趘跃跉趓趥趧(int rowN, int columN)
	{
		_32DC_32DE_32D9_32E4_32AD_32DD_32C3_32DB_32D9_32AC_32A8_32DC_32AD_32C9_32BE = rowN;
		䰎䰏䰏䱁䱐䰥䰔䰽䰍䰩䱀䰕䰍䱀䰕 = columN;
		铯铯铲铺锪铯铲锞铩锞铭锛铪铮铬 = new double[rowN, columN];
	}
}
